set sdc_version 1.4


# Set the current design
current_design darkriscv

set_units -time 1ns
set_units -capacitance 1pF


#set_case_analysis 0 [get_ports test_mode]
#set_case_analysis 0 [get_ports scan_en]
create_clock -name "CLK" -add -period 16.0 -waveform {0.0 8.0} [get_ports CLK]

#set_false_path -from [list \
#  [get_ports reset]  \
#  [get_ports test_mode] ]

#set_false_path -hold -through [get_pins PM_INST/clk_enable]

set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports RES]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports HLT]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports INT]

set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[30]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IDATA[31]}]

set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {IADDR[31]}]

set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[0]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[1]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[2]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[3]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[4]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[5]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[6]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[7]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[8]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[9]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[10]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[11]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[12]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[13]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[14]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[15]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[16]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[17]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[18]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[19]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[20]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[21]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[22]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[23]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[24]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[25]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[26]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[27]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[28]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[29]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[30]}]
set_input_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAI[31]}]

set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DATAO[31]}]

set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[4]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[5]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[6]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[7]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[8]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[9]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[10]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[11]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[12]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[13]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[14]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[15]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[16]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[17]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[18]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[19]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[20]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[21]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[22]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[23]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[24]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[25]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[26]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[27]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[28]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[29]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[30]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DADDR[31]}]


set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {BE[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {BE[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {BE[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {BE[3]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports WR]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports RD]

set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports IDLE]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DEBUG[0]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DEBUG[1]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DEBUG[2]}]
set_output_delay -clock [get_clocks CLK] -add_delay 0.3 [get_ports {DEBUG[3]}]


set_max_fanout 15.000 [current_design]
set_max_transition 1.2 [current_design]
